package de.telran.homework11_10;

import java.util.Scanner;

public class Task2 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите год: ");
        int jear = scanner.nextInt();
       // boolean isLeap = isLeap(jear);
        System.out.println( "Год :");


    }
    //public static boolean isLeap(int jear){
    // return jear;
    //}
}
    //Реализуйте программу, которая попросит пользователя ввести год и напечатать этот год.
// Метод isLeap проверяет високосный год или нет.

